app/Controllers/BarangController.php

SELECT *
FROM `barangs`
---
    public function index()
    {
        $model = new BarangModel();
        $barang = $model->findAll();

INSERT INTO `barangs` (`name`, `category`, `supplier`, `stock`, `price`, `note`, `image`, `created_at`, `updated_at`) VALUES ('fgdfgd', 'gdfgdfg', 'dfgdfgdf', '46456', '45645654', 'fhfghjhjghj', 'computer-11083.png', '2023-08-29 03:08:29', '2023-08-29 03:08:29')
---
        }

        $model = new BarangModel();
        $model->insert($data);

SELECT *
FROM `barangs`
WHERE `id_barang` = '11'
 LIMIT 1
---
    public function edit($id_barang)
    {
        $model = new BarangModel();
        $barang = $model->where('id_barang', $id_barang)->first();